title: VBScript execution in Temp directory
id: 
description: Detects WScript or CScript excecting a file within a TEMP directory
status: experimental
references:
tags:
    - attack.execution
    - attack.t1059
    - attack.t1202
author: Trent Liffick
date: 2020/05/05
logsource:
    category: process_creation
    product: windows
detection:
  selection:
    Image:
      - '*\cscript.exe'
      - '*\wscript.exe'
    CommandLine:
      - '*Users\Public\*'
      - '*PUBLIC*'
      - '*\AppData\Local\Temp\*'
      - '*TEMP*'
    Filter:
      - 'C:\Windows\ccmcache\*'
  condition: selection
fields:
    - Image
    - CommandLine
    - ParentCommandLine
falsepositives:
  - SCCM deployments
level: medium