title: Findstr launching link file
id: 
description: Detects usage of findstr to identify and execute a lnk file as seen within the HHS redirect attack
status: experimental
references:
    - https://www.bleepingcomputer.com/news/security/hhsgov-open-redirect-used-by-coronavirus-phishing-to-spread-malware/
tags:
    - attack.execution
    - attack.t1059
    - attack.t1202
    - attack.1034
author: Trent Liffick
date: 2020/05/01
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\findstr.exe'
        CommandLine: '*.lnk'
    condition: selection
fields:
    - Image
    - CommandLine
    - ParentCommandLine
falsepositives:
level: medium